{
  "basics": {
    "name": "Robert Ryan Chu",
    "label": "Software Engineer/Software QA",
    "picture": "https://scontent.fceb2-1.fna.fbcdn.net/v/t1.0-9/12391217_515522341952163_2854758565939960023_n.jpg?oh=950e4c6a8bea620a6c3de5b45412808a&oe=59560CFE",
    "email": "rcchu@rogomi.com",
    "phone": "+639273703825"
  },
  "education": [{
    "institution": "Central Philippine University",
    "course": "Software Engineering",
    "studyType": "Bachelor",
    "startDate": "2009",
    "endDate": "2014"
  }],
  "skills": [
    {
      "category": "Programming Languages",
      "technologies":[{
        "name": "Java",
        "number_of_years": 3
      }, {
        "name": "Javascript",
        "number_of_years": 1
      }, {
        "name": "HTML",
        "number_of_years": 2
      }, {
        "name": "CSS",
        "number_of_years": 2
      }]
    },{
      "category": "Databases",
      "technologies":[{
        "name": "MySql",
        "number_of_years": 2
      }]
    },{
      "category": "Content Management System",
      "technologies":[{
        "name": "WordPress",
        "number_of_years": 2
      }]
    },{
      "category": "Version Control",
      "technologies":[{
        "name": "Git",
        "number_of_years": 3
      }]
    },{
      "category": "Operating System",
      "technologies":[{
        "name": "Windows",
        "number_of_years": 8
      }]
    },{
      "category": "Integrated Development Environment",
      "technologies":[{
        "name": "NetBeans",
        "number_of_years": 3
      }, {
        "name": "Android Studio",
        "number_of_years": 2
      }, {
        "name": "Xcode",
        "number_of_years": 1
      }, {
        "name": "Eclipse",
        "number_of_years": 2
      }]
    }
  ],
  "work": [{
    "company": "Rogomi Inc.",
    "position": "Mobile Analyst",
    "startDate": "March 2015",
    "endDate": "Present",
    "summary": "Analyzing design and functional aspects of a project to reveal and address loopholes, inconsistencies and/or ambiguities. Preparing test cases and tailoring testing strategies for projects. Communicating with clients for project-related requirements, clarifications, issues, etc. Assisting the Development team in diagnosing bugs and other issues in products. Ensuring that the software delivered to clients are of excellent quality. Undertaking internal quality audits to help identify problems or deficiencies in service delivery. Accomplishing miscellaneous I.T. and business-related tasks",
    "highlights": [],
    "projects":[
            {
        "name":"Gift it (Android & iOS)",
        "description":"With Gift It you can send digital gift cards, products and free gifts from all your favourite brands and retailers to your friends and family! Simply download the app,find a gift, choose who gets it and send! Join the world of Gift It and change the way you think of gifting. No more long queues, last minute mall dashes or being the empty handed, unpopular one at the party! This project is an update of an already existing app.",
        "role":"Mobile Analyst",
        "startDate":"June 2016",
        "endDate":"Present",
      },{
        "name":"Book it (Android & iOS)",
        "description":"BOOK IT addresses the need to book an appointment painlessly and more efficiently. It allows users to select new service establishments around nearby or by location. It allows users to choose detail of service he wants to avail even before reaching the establishment. It serves as an online menu of services by category of provider and by proximity.",
        "role":"Mobile Analyst",
        "startDate":"May 2016",
        "endDate":"Present",
      },{
        "name":"PlantQueue (Android)",
        "description":"This is an Android app proposed by the Ateneo Department of Chemistry to document and process vials of liquid efficiently. It allows users to take photos & send these photos to a server for processing. Users will be able to see the results of the process after processing is done."
        "role":"Mobile Analyst",
        "startDate":"April 2016",
        "endDate":"June 2016",
      },{
        "name":"Safety Vine (iOS)",
        "description":"An app for tracking a user's location, takes note of his/her parking place and taxi ride, and alerts others if that user is in danger by sending that user's location."
        "role":"Mobile Analyst",
        "startDate":"April 2016",
        "endDate":"July 2016",
      },{
        "name":"WHS Monitor (Android & iOS)",
        "description":"WHS MONITOR ™ is a modular, cloud-based compliance software system that assists businesses to meet their Work Health and Safety obligations. The WHS MONITOR ™ system has been developed to deliver cost effective support to organisations of all types and sizes.- WHS Monitor website"
        "role":"Mobile Analyst",
        "startDate":"December 2015",
        "endDate":"April 2017",
      },{
        "name":"Eat Out Manila (Android & iOS)",
        "description":"A restaurant reservations app which allows users to:  Book at favorite restaurants for FREE. Get table reservations confirmed in a snap. Search restaurants by name, cuisine, location or proximityain access to full restaurant menus and chef’s recommendations. Enjoy premium promos from Eat Out Manila’s partner restaurants."
        "role":"Mobile Analyst",
        "startDate":"March 2015",
        "endDate":"September 2016",
      },{
        "name":"SINAG (Android & iOS)",
        "description":"A Philippine weather app with weekly and hourly forecasts, news updates and user updates for areas within PH territory."
        "role":"Mobile Analyst",
        "startDate":"March 2015",
        "endDate":"July 2015",
      },{
        "name":"Cignal Front Seat (Android & iOS)",
        "description":"An app that provides premiere video streaming experience powered by SMART, Cignal and PLDT HOME. This allows you to watch what you want, when you want, however you want."
        "role":"Mobile Analyst",
        "startDate":"2015",
        "endDate":"2017",
      },{
        "name":"Medix (Android + iOS)",
        "description":"A dental management app which transforms the Doctor-Patient experience through cloud-based electronic medical records accessible anytime, anywhere providing the easiest way to update, maintain, and organize all your medical records."
        "role":"Mobile Analyst",
        "startDate":"2015",
        "endDate":"2015",
      },{
        "name":"More Fun (Android & iOS)",
        "description":"The More Fun Mobile App is the traveler’s ultimate pocket guide to visiting the Philippines’ top destinations. Find out what to do and where to go in Manila, Boracay, Davao, and Cebu. Key Features: Shopping – From high-end malls to side stalls, find the best places to shop for must-haves and souvenirs. Food – Craving for authentic Filipino fare? Discover the best places to eat here.  Culture – Get to know more about life in the Philippines, and its rich history and colorful traditions. Talk Pinoy – Learn common words and phrases in the local language. Fun in 24H – Feeling restless? Here’s a bucketlist of things to do, places to see, and the most fun you can have in the Philippines –all in 24 hours."
        "role":"Mobile Analyst",
        "startDate":"2015",
        "endDate":"2015",
      }
    ]
  }
  ],
  "certification": []
}